[Entrench X2AbilityTemplate]
LocFriendlyName="Entrench"
LocLongDescription="Hunker Down lasts until you move. Only works in cover."
LocHelpText="Hunker Down lasts until you move. Only works in cover."
LocFlyOverText="Entrench"
LocPromotionPopupText="<Bullet/> Entrench confers +30 defense and +50 dodge, just like regular Hunker Down.<br/>"

[TakeUnder X2AbilityTemplate]
LocFriendlyName="Take Under"
LocLongDescription="An attack with your melee weapon that always hits and doesn't end the turn. Can only be used against wounded targets on 3 or less health."
LocHelpText="Finish off an enemy."
LocFlyOverText="Take Under"
LocPromotionPopupText="<Bullet/> Mechanically, this works just like the standard slash.\n<Bullet/>Attacking with a dash move will still only cost one action, but you need to have two actions currently available to dash.\n<Bullet/>This attack will never miss or graze, but its damage can still be mitigated by armor and other damage reduction effects.<br/>"

[Beatdown X2AbilityTemplate]
LocFriendlyName="Beatdown"
LocLongDescription="Strike an enemy with the butt of your weapon, dealing only little damage, but stunning the target. Can only be used on unarmored, non-robotic targets. Has a 3 turn cooldown."
LocHelpText="Deals 1 damage, stuns target. Can't target armored or mechanical enemies."
LocFlyOverText="Beatdown"
LocPromotionPopupText="<Bullet/> Do 1 damage to an enemy utilizing the butt of your gun. Stuns the target. Can only be used on unarmored, non-robotic targets. Has a 3 turn cooldown.<br/>"

[ABB_Infiltrator X2AbilityTemplate]
LocFriendlyName="Heist Artist"
LocFlyOverText="Heist Artist"
LocLongDescription="Your skills are required for a job. As a master of espionage and intel acquisition, you gain +150 Hacking."
LocHelpText="You gain +150 Hacking."
LocPromotionPopupText="<Bullet/> Your hacking score is big enough to ensure getting a bonus on most hack missions.<br/><Bullet/>Note that you still can't use Gremlins and are unable to hack towers, bots, etc.<br/><Bullet/>The bonus DOES apply to Skullmining.<br/><Bullet/> The Hacking bonus is added via an item that's added to the soldier's inventory during tactical missions."

[DriveOut X2AbilityTemplate]
LocFriendlyName="Drive Out"
LocLongDescription="Strike an enemy with the butt of your weapon, dealing only little damage, but knocking the target back, possibly out of cover. Cannot be used against mechanical targets. Has a 3 turn cooldown."
LocHelpText="Deals 2 damage and knocks back target. Can't target mechanical enemies."
LocFlyOverText="Drive Out"

[ABB_Parkour X2AbilityTemplate]
LocFriendlyName="Parkour"
LocHelpText="This soldier is able to climb walls."
LocLongDescription="This soldier is able to climb walls. Note that windows cannot be climbed."

[Anatomy X2AbilityTemplate]
LocFriendlyName="Anatomy"
LocFlyOverText="Anatomy"
LocLongDescription="You know exactly where to strike to cause the most damage. You gain +15% Critical Chance and 2 Armor Pierce on all attacks."
LocHelpText="You gain bonuses to Critical Chance and Armor Pierce."
LocPromotionPopupText="<Bullet/> This is an unconditional passive bonus.\n<Bullet/> The Armor Pierce bonus will not show on attack previews, but it will function when the attack lands."

[Interrogator X2AbilityTemplate]
LocFriendlyName="Interrogator"
LocFlyOverText="Interrogator"
LocLongDescription="At one point, this job involved dialogue. Gain +1 Skullmining charge when carrying the Skulljack."
LocHelpText="Gain +1 Skullmining charge when carrying the Skulljack."
LocPromotionPopupText="<Bullet/> The Skullmining project in the Proving Ground must be completed for this ability to have any effect."

[SlashAndDashRS X2AbilityTemplate]
LocFriendlyName="Run And Slice"
LocLongDescription="Move to and slice a target. Uses one action and doesn't end the turn but can only be used once per turn. Has a 4 turn cooldown that can be reset by using other knife perks."
LocHelpText="Move to and slice a target. Uses one action and doesn't end the turn but can only be used once per turn. Has a 4 turn cooldown that can be reset by using other knife perks."
LocFlyOverText="Run And Slice"
LocPromotionPopupText="<Bullet/>Move to and slice a target. Uses one action but can only be used once per turn.\n<Bullet/>The abilities that are able to reset the cooldown are Disarming Strike, Lacerate, Shadowmelt and Hamstring."

[DisarmingStrike X2AbilityTemplate]
LocFriendlyName="Disarming Strike"
LocLongDescription="A knife strike that also disables the enemy's primary weapon, forcing the enemy to spend an action to ready it again. Resets Run and Slice. Has a 2 turn cooldown."
LocHelpText="Attack and disarm an enemy."
LocFlyOverText="Disarm"
LocPromotionPopupText="<Bullet/> Like all knife attacks, this uses one action and does not end your turn.\n<Bullet/> The enemy's primary weapon will need to be reloaded before it can be used again.<br/>"

[Lacerate X2AbilityTemplate]
LocFriendlyName="Lacerate"
LocLongDescription="A knife strike that cuts open something important, causing the target to bleed out. Resets Run and Slice. Has a 3 turn cooldown."
LocHelpText="Strike and cause bleeding."
LocFlyOverText="Lacerate"
LocPromotionPopupText="<Bullet/> Like all knife attacks, this uses one action and does not end your turn.\n<Bullet/> The bleeding effect deals 2 damage per turn and lasts for 10 turns.<br/>"

[Shadowmelt X2AbilityTemplate]
LocFriendlyName="Shadowmelt"
LocLongDescription="Strike an enemy with the knife. If you kill the target, enter concealment. Resets Run and Slice. Has a 3 turn cooldown."
LocHelpText="Strike a target. On kill, enter concealment."
LocFlyOverText="Shadowmelt"
LocPromotionPopupText="<Bullet/> Like all knife attacks, this uses one action and does not end your turn.\n<Bullet/> Has a 3 turn cooldown.<br/>"

[Hamstring X2AbilityTemplate]
LocFriendlyName="Hamstring"
LocLongDescription="A crippling knife slash. Applies a permanent -7 movement, -30 aim and -50 dodge debuff. Resets Run and Slice. Has a 3 turn cooldown."
LocHelpText="Slash an enemy, reducing the enemy's movement, aim and dodge."
LocFlyOverText="Hamstring"
LocPromotionPopupText="<Bullet/> Like all knife attacks, this uses one action and does not end your turn.\n<Bullet/> Has a 3 turn cooldown.<br/><Bullet/>Can be applied multiple times to the same enemy; the debuffs stack.<br/>"

[NimbleHands X2AbilityTemplate]
LocFriendlyName="Nimble Hands"
LocLongDescription="As a free action, reload your weapon. Can be used every 3 turns."
LocHelpText="Reload your weapon as a free action."
LocFlyOverText="Nimble Hands"

[ABB_TrialByFire X2AbilityTemplate]
LocFriendlyName="Trial By Fire"
LocLongDescription="Permanently gain +1 Aim and +1 Will at the start of each mission."
LocHelpText="Gain 1 Aim and 1 Will at the start of each mission."
LocPromotionPopupText="<Bullet/>Triggers at the start of each mission.<br/>"
LocFlyOverText="Trial By Fire: +1 aim/will"

[Taunt X2AbilityTemplate]
LocFriendlyName="Taunt"
LocLongDescription="Try to draw enemy fire towards you. Decrease Defense by 30, and increase Dodge by 70. Is used like Hunker Down, ending the turn."
LocHelpText="Try to draw enemy fire towards you. Decrease Defense by 30, and increase Dodge by 70."
LocFlyOverText="Taunt"
LocPromotionPopupText="<Bullet/> Especially useful on soldiers with high armor to mitigate the incoming damage.\n<Bullet/> Is used like Hunker Down, but doesn't require cover. It also doesn't interact with Aim or Deep Cover."

[ShieldTaunt X2AbilityTemplate]
LocFriendlyName="Taunt (Shield)"
LocLongDescription="Try to draw enemy fire towards you. Decrease Defense by 80. Free action which can be used once per turn."
LocHelpText="Try to draw enemy fire towards you. Decrease Defense by 80. Free action which can be used once per turn."
LocFlyOverText="Taunt (Shield)"
LocPromotionPopupText="<Bullet/> Especially useful on soldiers with high armor and/or Dodge to mitigate the incoming damage.\n<Bullet/> Free action and can be used once per turn. \n<Bullet/> Is not considered an offensive action and thus still allows for a free stack of the Guard ability."

[HiddenReserves X2AbilityTemplate]
LocFriendlyName="Hidden Reserves"
LocLongDescription="Once per mission, as a free action, set all your cooldowns on abilities back to zero."
LocHelpText="Reset all your ability cooldowns."
LocFlyOverText="Hidden Reserves"

[TearDown X2AbilityTemplate]
LocFriendlyName="Tear Down"
LocLongDescription="As a free action, detonate an environmental explosive with a well placed shot."
LocHelpText="Detonate an environmental explosive."
LocPromotionPopupText="<Bullet/> Has a cooldown of 2 turns. Note that unlike the Reaper's Remote Start, Tear Down doesn't boost the explosion's damage or range, but it also does not require any ammo."

[ABB_Bombard X2AbilityTemplate]
LocFriendlyName="Iron Rations"
LocLongDescription="Gain one bonus use on all your grenades and equipped rockets. Also, get one extra Frag Grenade in addition to your equipped grenades."
LocHelpText="Your grenades and rockets gain one extra use each. Also, gain a bonus Frag Grenade."
LocFlyOverText="Iron Rations"
LocPromotionPopupText="<Bullet/> Battle Scanners are also considered grenades for the purposes of this ability. Note that heavy weapons, even if they're rocket or grenade based, are not affected by this ability."

[ABB_Cannonade X2AbilityTemplate]
LocFriendlyName="Cannonade"
LocLongDescription="Gain one bonus use on all your grenades and equipped rockets. Additionally gain the Bombardier ability, letting you launch grenades 2 extra tiles."
LocHelpText="Your grenades and rockets gain one extra use each. Additionally gain the Bombardier ability."
LocFlyOverText="Cannonade"
LocPromotionPopupText="<Bullet/> Battle Scanners are also considered grenades for the purposes of this ability. Note that heavy weapons, even if they're rocket or grenade based, are not affected by this ability."

[Battlespace X2AbilityTemplate]
LocFriendlyName="Battlespace"
LocLongDescription="Increases your vision radius by 3 tiles. Once per mission, you can increase this bonus to 12 tiles for a turn."
LocHelpText="Increases your vision radius by 3 tiles. Once per mission, you can increase this bonus to 12 tiles for a turn."
LocFlyOverText="Battlespace"

[BattlespacePassive X2AbilityTemplate]
LocFriendlyName="Battlespace"
LocLongDescription="You gain +3 sight radius from Battlespace."
LocHelpText="You gain +3 sight radius from Battlespace."
LocPromotionPopupText="<Bullet/> The extra +9 sight radius wears off after one turn.\n<Bullet/> The +3 sight radius is permanent.<br/>"

[MineLayer X2AbilityTemplate]
LocFriendlyName="Minelayer"
LocHelpText="Provides one free proximity mine."
LocLongDescription="Provides one free proximity mine."

[RiotControl X2AbilityTemplate]
LocFriendlyName="Riot Control"
LocLongDescription="You have one free smoke grenade and one free flashbang use on every mission."
LocHelpText="You have one free smoke grenade and one free flashbang use on every mission."
LocFlyOverText="Riot Control"
LocPromotionPopupText="<Bullet/> These Flashbang and Smoke grenades will be equipped even if you're carrying other grenades.<br/>"

[TrainedSniper X2AbilityTemplate]
LocFriendlyName="Trained Sniper"
LocHelpText="Grants the Squadsight ability, but only when a sniper rifle is equipped as this soldier's primary weapon."
LocLongDescription="Grants the Squadsight ability, but only when a sniper rifle is equipped as this soldier's primary weapon."
LocPromotionPopupText="<Bullet/> Any weapon from the sniper rifle category counts for this ability, such as the Auto-Sniper Rifle or the Strike Rifle, in addition to the standard Sniper Rifle.<br/>"

[PerfectPlan X2AbilityTemplate]
LocFriendlyName="Perfect Plan"
LocHelpText="Gain the ability to climb walls, as well as negate the penalties of failed hacks."
LocLongDescription="Gain the ability to climb walls, as well as negate the penalties of failed hacks."
LocPromotionPopupText="<Bullet/> Even without a GREMLIN or BIT, Failsafe can still guard against failure effects from Skullmining attempts or hacking ADVENT Security Towers with a Hacker's Laptop.\n<Bullet/> Walls can be climbed, but not windows."

[Jingoistic X2AbilityTemplate]
LocFriendlyName = "Jingoistic"
LocHelpText = "It's time for war. This soldier is granted a grenade slot as well as a heavy weapon slot, regardless of armor worn."
LocLongDescription = "It's time for war. This soldier is granted a grenade slot as well as a heavy weapon slot, regardless of armor worn."
LocPromotionPopupText = "<Bullet/> Note that the bonus slots from this ability do not stack with most other abilities or equipment that offer one or both of the same slots, e.g. EXO or WAR Suits."

[ABB_TakeDown X2AbilityTemplate]
LocFriendlyName="Take Down"
LocFlyOverText="Take Down"
LocHelpText="A melee finisher that never misses and does not end your turn even when used with a dash move, but can only target damaged enemies on 3 or less HP. Can be used once per turn."
LocLongDescription="A melee finisher that never misses and does not end your turn even when used with a dash move, but can only target damaged enemies on 3 or less HP. Can be used once per turn."
LocPromotionPopupText="<Bullet/> This attack always deals 5 damage. If the enemy has enough armor or other damage resistance, Take Down may not always result in a kill.\n<Bullet/> Take Down can be used once per turn, and can be used with a dash only if used as the first action.\n<Bullet/> Unlike Take Under, Take Down does not rely on a melee weapon. Human soldiers will use the stock of their gun, and certain aliens will throw a punch or slash with their claws."

[MarathonRunner_MJ X2AbilityTemplate]
LocFriendlyName="Marathon Runner"
LocLongDescription="Spend 2 action points to gain 3 movement-only action points. Can be used every other turn."
LocHelpText="Spend 2 action points to gain 3 movement-only action points. 1 turn cooldown."
LocFlyOverText="Marathon Runner"
LocPromotionPopupText="<Bullet/> Marathon Runner is not only great for allowing the <Ability:ClassName/> to rendezvous with the rest of the squad, but also for moving ahead of the rest of the squad to mark supply crates or rescue civilians.\n<Bullet/> Can be used every other turn.\n<Bullet/> Remember: after you activate this ability, the <Ability:ClassName/> won't be able to attack for the remainder of this turn under most circumstances.\n<Bullet/> You can still give extra actions to this soldier such as via Teamwork or Command."

[PrototypeKineticDrivers X2AbilityTemplate]
LocFriendlyName="Prototype Kinetic Drivers"
LocLongDescription="The Prototype Strike Module increases the damage of melee attacks by +2, or +1 for half-damage melee attacks such as Counterstrike."
LocHelpText="The Prototype Strike Module increases the damage of melee attacks by +2, or +1 for half-damage melee attacks such as Counterstrike."
LocFlyOverText="Prototype Kinetic Drivers"

[40mmGrenadePouches X2AbilityTemplate]
LocFriendlyName="40mm Grenade Pouches"
LocLongDescription="This armor features pouches intended for the storage of extra 40mm grenades. This soldier will be able to reload an Underbarrel Grenade Launcher 2 extra times per mission."
LocHelpText="This armor features pouches intended for the storage of extra 40mm grenades. This soldier will be able to reload an Underbarrel Grenade Launcher 2 extra times per mission."
LocFlyOverText="40mm Grenade Pouches"

[AssaultShot X2AbilityTemplate]
LocFriendlyName="Assault Shot"
LocHelpText="A shot that does not cost an action that can be used once per turn, but only against targets within 4 tiles of the shooter. Can be used even while disoriented, but not while burning."
LocLongDescription="A shot that does not cost an action that can be used once per turn, but only against targets within 4 tiles of the shooter. Can be used even while disoriented, but not while burning."

[ShortShot X2AbilityTemplate]
LocFriendlyName="Short Shot"
LocHelpText="A shot that can only be used against targets within 4 tiles of the shooter. Can be used even while disoriented, but not while burning. Costs 1 action and ends the turn."
LocLongDescription="A shot that can only be used against targets within 4 tiles of the shooter. Can be used even while disoriented, but not while burning. Costs 1 action and ends the turn."

[ShortShotGatlingMec X2AbilityTemplate]
LocFriendlyName="Short Shot"
LocHelpText="A shot that can only be used against targets within 6 tiles of the shooter. Can be used even while disoriented, but not while burning. Costs 1 action and ends the turn."
LocLongDescription="A shot that can only be used against targets within 6 tiles of the shooter. Can be used even while disoriented, but not while burning. Costs 1 action and ends the turn."

[TelekinesisShot X2AbilityTemplate]
LocFriendlyName="Telekinesis Shot"
LocHelpText="A special shot guided by Psionic power that ignores cover bonuses but can't get critical hits. Can only be used against targets in cover and not flanked by the shooter. 3 turn cooldown between uses."
LocLongDescription="A special shot guided by Psionic power that ignores cover bonuses but can't get critical hits. Can only be used against targets in cover and not flanked by the shooter. 3 turn cooldown between uses. Costs 2 actions and ends the turn when used. Use is prevented while disoriented or suppressed."

[WatchfulRaptor X2AbilityTemplate]
LocFriendlyName="Watchful Raptor"
LocHelpText="Automatically enter Overwatch after using Psi Strike or Telekinesis Shot."
LocLongDescription="Automatically enter Overwatch after using Psi Strike or Telekinesis Shot."

[SeeTheFuture X2AbilityTemplate]
LocFriendlyName="See The Future"
LocLongDescription="Become Untouchable against a single attack. Can only be used in Defensive stance. Costs 1 action and ends the soldier's turn when used."
LocHelpText="Become Untouchable against a single attack. Can only be used in Defensive stance. Costs 1 action and ends the soldier's turn when used."
LocFlyOverText="See The Future"
LocPromotionPopupText="<Bullet/> Can be used once per turn.\n<Bullet/> See The Future can be a great way to bait and enemy attack, but consider carefully choosing to use it over moving to better cover if multiple uncontrolled enemies are still active."

[StasisShell X2AbilityTemplate]
LocFriendlyName="Stasis Shell"
LocLongDescription="Put yourself into Stasis until the start of your next turn. Can only be used in Defensive stance and only once every other turn. Costs 1 action and ends the soldier's turn when used."
LocHelpText="Put yourself into Stasis until the start of your next turn. Can only be used in Defensive stance and only once every other turn. Costs 1 action and ends the soldier's turn when used."
LocFlyOverText="Stasis Shell"
LocPromotionPopupText="<Bullet/> Can be used once every other turn.\n<Bullet/> Stasis Shell will make the <Ability:ClassName/> completely untargetable, which for better or worse will force enemies to target your other squad members.\n<Bullet/> The <Ability:ClassName/> may still take damage from falls or find themselves standing in a fire when emerging from Stasis Shell, so be aware of potential dangerous positions."

[Multitasking X2AbilityTemplate]
LocFriendlyName="Multitasking"
LocHelpText="Whenever you Aid Protocol a target, you also Aid Protocol yourself."
LocLongDescription="Whenever you Aid Protocol a target, you also Aid Protocol yourself. This includes Threat Assessment, if available."
LocPromotionPopupText="<Bullet/> Multitasking only functions when targeting a unit other than yourself. Targeting yourself will NOT stack the effect."

[FreeScanner X2AbilityTemplate]
LocFriendlyName="Reconnoiter"
LocHelpText="Every 4 turns, as a free action, you can use a Battle Scanner."
LocLongDescription="Every 4 turns, as a free action, you can use a Battle Scanner. This does not require or consume any actual equipped Battle Scanners."
LocPromotionPopupText="<Bullet/> The Battle Scanners granted by Reconnoiter can be used indefinitely, only limited by the cooldown.\n<Bullet/> These Battle Scanners are separate from the ones granted by the Battle Scanner item or the Scout ability."

[ScoutScanner X2AbilityTemplate]
LocFriendlyName="Reconnoiter"
LocHelpText="Every 4 turns, as a free action, you can use a Battle Scanner."
LocLongDescription="Every 4 turns, as a free action, you can use a Battle Scanner. This does not require or consume any actual equipped Battle Scanners."
LocPromotionPopupText="<Bullet/> The Battle Scanners granted by Reconnoiter can be used indefinitely, only limited by the cooldown.\n<Bullet/> These Battle Scanners are separate from the ones granted by the Battle Scanner item or the Scout ability."

[HurricaneSlash X2AbilityTemplate]
LocFriendlyName="Hurricane Slash"
LocHelpText="Slash an adjacent target. Costs 1 movement-only action point and does not end the turn if you have other actions remaining."
LocLongDescription="Slash an adjacent target. Costs 1 movement-only action point and does not end the turn if you have other actions remaining."
LocPromotionPopupText="<Bullet/> This ability will not be of any use at all if you don't also have an ability that grants movement-only action points to the soldier, such as Whirlwind or Marathon Runner.\n<Bullet/> Hurricane Slash cannot be used if the soldier is burning or disoriented.\n<Bullet/> Does not have a cooldown.\n<Bullet/> When used in conjunction with Whirlwind and Reaper, Hurricane Slash can allow you to mitigate an unlucky damage roll on the first target of your Reaper chain."

[Bullfighter X2AbilityTemplate]
LocFriendlyName="Bullfighter"
LocHelpText="Make an extremely accurate dashing melee attack against a target that deals little damage but stuns for 2 actions."
LocLongDescription="An extremely accurate dashing melee attack against a target that deals little damage but stuns for 2 actions. Costs 1 action, ends the turn when used, and has no cooldown. Replaces Bull Rush."
LocPromotionPopupText="<Bullet/> Bullfighter can be used to stun mechanical units as well as organic ones. Only immunity to stun or immunity to all mental afflictions will hamper it.\n<Bullet/> While Bull Rush only has a +15 Aim modifier, Bullfighter has a +100 Aim modifier, and thus will not ever miss in most situations."

[Phasic_Shot_MJ X2AbilityTemplate]
LocFriendlyName="Phase Shot"
LocLongDescription="The Military Assault MEC's shotgun is loaded with phase rounds, these rounds ignore armor, shields, and cover defense bonuses. Robotic entities cannot be targeted by this ability."
LocHelpText="Shotgun attacks ignore armor, shields, and cover defense bonuses. Robotic enemies cannot be targeted."
LocFlyOverText="Phase Shot"

[SoulMania X2AbilityTemplate]
LocFriendlyName="Soul Mania"
LocLongDescription="Free Psionic attacks on any enemies that enter or attack from within 2 tiles. Guaranteed to hit but will not target robots or units with Shadowstep."
LocHelpText="Free Psionic attacks on any enemies that enter or attack from within 2 tiles. Guaranteed to hit but will not target robots or units with Shadowstep."
LocFlyOverText="Soul Mania"
LocPromotionPopupText="<Bullet/> If an enemy begins their turn within 2 tiles, Soul Mania will trigger if that enemy tries to attack the <Ability:ClassName/>.\n<Bullet/> If an enemy does not begin their turn within 2 tiles, then Soul Mania will trigger when that enemy moves into that range.\n<Bullet/> Soul Mania deals the same base Psionic damage as Soulfire and similarly cannot target robots, but does NOT ignore armor or shields like Soulfire does.\n<Bullet/> Soul Mania is guaranteed to hit, but is still considered a reaction attack and thus won't target units that have Shadowstep.\n<Bullet/> Will not trigger during the <Ability:ClassName/>'s own turn."

[SoulManiaAttack X2AbilityTemplate]
LocFriendlyName="Soul Mania"
LocLongDescription="Free Psionic attacks on any enemies that enter or attack from within 2 tiles. Guaranteed to hit but will not target robots or units with Shadowstep."
LocHelpText="Free Psionic attacks on any enemies that enter or attack from within 2 tiles. Guaranteed to hit but will not target robots or units with Shadowstep."
LocFlyOverText="Soul Mania"
LocPromotionPopupText="<Bullet/> If an enemy begins their turn within 2 tiles, Soul Mania will trigger if that enemy tries to attack the <Ability:ClassName/>.\n<Bullet/> If an enemy does not begin their turn within 2 tiles, then Soul Mania will trigger when that enemy moves into that range.\n<Bullet/> Soul Mania deals the same base Psionic damage as Soulfire and similarly cannot target robots, but does NOT ignore armor or shields like Soulfire does.\n<Bullet/> Soul Mania is guaranteed to hit, but is still considered a reaction attack and thus won't target units that have Shadowstep.\n<Bullet/> Will not trigger during the <Ability:ClassName/>'s own turn."

[AssaultMecCCS X2AbilityTemplate]
LocFriendlyName="Close Combat Shot"
LocLongDescription="Once per turn, fire a reaction shot with your <Ability:WeaponName/> at any target that moves to within 4 tiles."
LocHelpText="Once per turn, fire a reaction shot with your <Ability:WeaponName/> at any target that moves to within 4 tiles."
LocFlyOverText="Close Combat Shot"
LocPromotionPopupText="<Bullet/> Only triggers on movement, not other actions.\n<Bullet/> Won't trigger if the target is already within 4 tiles of you.\n<Bullet/> Will not trigger during the <Ability:ClassName/>'s own turn."

[AssaultMecCCSPhase X2AbilityTemplate]
LocFriendlyName="Close Combat Phase Shot"
LocLongDescription="Once per turn, fire a reaction shot with your <Ability:WeaponName/> at any target that moves to within 4 tiles. Ignores armor and shields but cannot target robots."
LocHelpText="Once per turn, fire a reaction shot with your <Ability:WeaponName/> at any target that moves to within 4 tiles. Ignores armor and shields but cannot target robots."
LocFlyOverText="Close Combat Phase Shot"
LocPromotionPopupText="<Bullet/> Only triggers on movement, not other actions.\n<Bullet/> Won't trigger if the target is already within 4 tiles of you.\n<Bullet/> Will not trigger during the <Ability:ClassName/>'s own turn."

[BloodyKnuckles X2AbilityTemplate]
LocFriendlyName="Bloody Knuckles"
LocHelpText="Gain +3 damage with all melee attacks."
LocLongDescription="Gain +3 damage with all melee attacks."
LocPromotionPopupText="<Bullet/> This affects ALL melee attacks, including but not limited to attacks with a knife, sword, ripjack, or bayonet, and attacks that don't rely on a weapon such as Bull Rush."
LocFlyOverText="Bloody Knuckles"

[RagingBull X2AbilityTemplate]
LocFriendlyName="Raging Bull"
LocHelpText="A free melee attack on any enemy that enters or attacks from melee range. Deals minor damage and is guaranteed to stun for 2 actions on a hit. This attack will be attempted as many times as there are targets, but only until it successfully lands a hit within a given turn. Will not trigger during the <Ability:ClassName/>'s own turn. Has a 1 turn cooldown between successful hits."
LocLongDescription="A free melee attack on any enemy that enters or attacks from melee range. Deals minor damage and is guaranteed to stun for 2 actions on a hit. This attack will be attempted as many times as there are targets, but only until it successfully lands a hit within a given turn. Will not trigger during the <Ability:ClassName/>'s own turn. Has a 1 turn cooldown between successful hits."
LocPromotionPopupText="<Bullet/> Raging Bull can be used to stun mechanical units as well as organic ones. Only immunity to stun or immunity to all mental afflictions will hamper it.\n<Bullet/> Will not trigger during the <Ability:ClassName/>'s own turn. \n<Bullet/> The 1 turn cooldown only takes effect on a successful hit. Note that even if this attack does not actually stun the hit target, it's still counted as a hit for the purposes of the cooldown, so be wary of stun immune enemies such as Celatids."
LocFlyOverText="Raging Bull"

[RagingBullAttack X2AbilityTemplate]
LocFriendlyName="Raging Bull"
LocHelpText="A free melee attack on any enemy that enters or attacks from melee range. Deals minor damage and is guaranteed to stun for 2 actions on a hit. This attack will be attempted as many times as there are targets, but only until it successfully lands a hit within a given turn. Will not trigger during the <Ability:ClassName/>'s own turn."
LocLongDescription="A free melee attack on any enemy that enters or attacks from melee range. Deals minor damage and is guaranteed to stun for 2 actions on a hit. This attack will be attempted as many times as there are targets, but only until it successfully lands a hit within a given turn. Will not trigger during the <Ability:ClassName/>'s own turn."
LocPromotionPopupText="<Bullet/> Raging Bull can be used to stun mechanical units as well as organic ones. Only immunity to stun or immunity to all mental afflictions will hamper it.\n<Bullet/> Will not trigger during the <Ability:ClassName/>'s own turn."
LocFlyOverText="Raging Bull"

[ColdSnap X2AbilityTemplate]
LocFriendlyName="Cold Snap"
LocHelpText="The first time you use a Cryolator's standard shot each turn will refund one standard action point."
LocLongDescription="The first time you use a Cryolator's standard shot each turn will refund one standard action point. Does not apply to special shots such as Fulmination, or Canister attacks."
LocFlyOverText="Cold Snap"

[Sawbones X2AbilityTemplate]
LocFriendlyName="Sawbones"
LocHelpText="Gain the Savior and Neutralizing Agents abilities. Additionally, the first time you use Medical Protocol each turn will refund one standard action point."
LocLongDescription="Gain the Savior and Neutralizing Agents abilities. Additionally, the first time you use Medical Protocol each turn will refund one standard action point."
LocPromotionPopupText="<Bullet/> Savior increases the healing of all healing abilities by 4 points.\n<Bullet/> Neutralizing Agents allows Aid Protocol to remove burning, poison, acid, and bleeding effects from targets.\n<Bullet/> Neutralizing Agents only affects Aid Protocol, not Stronghold Protocol."
LocFlyOverText="Sawbones"

[SawbonesPassive X2AbilityTemplate]
LocFriendlyName="Sawbones"
LocHelpText="Gain the Savior and Neutralizing Agents abilities. Additionally, the first time you use Medical Protocol each turn will refund one standard action point."
LocLongDescription="Gain the Savior and Neutralizing Agents abilities. Additionally, the first time you use Medical Protocol each turn will refund one standard action point."
LocPromotionPopupText="<Bullet/> Savior increases the healing of all healing abilities by 4 points.\n<Bullet/> Neutralizing Agents allows Aid Protocol to remove burning, poison, acid, and bleeding effects from targets.\n<Bullet/> Neutralizing Agents only affects Aid Protocol, not Stronghold Protocol."
LocFlyOverText="Sawbones"

[ShankRedemption X2AbilityTemplate]
LocFriendlyName="Shank Redemption"
LocHelpText="The first time you use Knife Fighter each turn will refund one standard action point."
LocLongDescription="The first time you use Knife Fighter each turn will refund one standard action point. Does not apply to any other knife skills."
LocFlyOverText="Shank Redemption"

[BeatUpPassive X2AbilityTemplate]
LocFriendlyName="Beat Up"
LocHelpText="Beatdown no longer has a cooldown."
LocLongDescription="Beatdown no longer has a cooldown."
LocPromotionPopupText="<Bullet/> Taking Beat Up will allow the soldier to reliably keep a single enemy target locked down over many turns.<Bullet/> Note that Beatdown's other restrictions are unaffected. It still cannot target robots or any enemy units that currently have at least 1 point of armor."
LocFlyOverText="Beat Up"